/*****************************************************************************
 *
 * This program is free software ; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307 USA
 *
 * $Id: pace.c 531 2006-01-04 12:56:13Z picard $
 *
 * The Core Pocket Media Player
 * Copyright (c) 2004-2005 Gabor Kovacs
 *
 ****************************************************************************/

#include "../common.h"

#if defined(TARGET_PALMOS)

#include "pace.h"
#include "peal/arm/pealstub.h"

//tremor uses lot of alloca()
#define STACKSIZE	0x8000
//#define STACKCHECK

#ifdef HAVE_PALMONE_SDK
#define NO_HSEXT_TRAPS
#include <68K/System/HardwareUtils68K.h>
#include <Common/System/HsNavCommon.h>
#include <68K/System/HsExt.h>
#endif

typedef struct launch
{
	UInt32 PealCall; //BE
	UInt32 Module; //BE
	UInt32 LoadModule; //BE
	UInt32 FreeModule; //BE
	UInt32 GetSymbol; //BE

	UInt16 launchParameters[2];
	UInt16 launchCode;
	UInt16 launchFlags;

} launch;

typedef struct gadgethandler
{
	uint8_t Code[68];
	struct gadgethandler* Next;

	FormGadgetTypeInCallback* Gadget; //BE
	uint16_t* Event; //BE
	UInt16 Cmd; //BE
	UInt32 Module; //BE
	UInt32 PealCall; //BE
	UInt32 Wrapper; //BE

	FormType* Form;
	int Index;
	FormGadgetHandlerType* Handler; 

} gadgethandler;

typedef struct eventhandler
{
	uint8_t Code[48];
	struct eventhandler* Next;

	uint16_t* Event; //BE
	UInt32 Module; //BE
	UInt32 PealCall; //BE
	UInt32 Wrapper; //BE

	FormType* Form;
	FormEventHandlerType *Handler;

} eventhandler;

static gadgethandler* GadgetHandler = NULL;
static eventhandler* EventHandler = NULL;
static launch Peal = {0};

static NOINLINE void FreeHandlers()
{
	gadgethandler* j;
	eventhandler* i;
	while ((i=EventHandler)!=NULL)
	{
		EventHandler = i->Next;
		MemPtrFree(i);
	}
	while ((j=GadgetHandler)!=NULL)
	{
		GadgetHandler = j->Next;
		MemPtrFree(j);
	}
}

static NOINLINE void SwapLanchParameters(int launchCode,void* launchParameters,bool_t From)
{
	if (launchCode == sysAppLaunchCmdCustomBase)
	{
		vfspath* p = (vfspath*)launchParameters;
		p->volRefNum = SWAP16(p->volRefNum);
	}

	if (launchCode == sysAppLaunchCmdOpenDB)
	{
		UInt16 tmp;
		SysAppLaunchCmdOpenDBType2* p = (SysAppLaunchCmdOpenDBType2*)launchParameters;
		p->cardNo = SWAP16(p->cardNo);
		tmp = p->dbID[0];
		p->dbID[0] = SWAP16(p->dbID[1]);
		p->dbID[1] = SWAP16(tmp);
	}

	if (launchCode == sysAppLaunchCmdNotify)
	{
